toarous/isr.org
* Overview

IDT (Interrupt Descriptor Table) maintains all handlers procedure information
1. ISR is short for Interrupt Service Routines which is the handler for the internal interrupt or exception.
2. IRQ for external interrupt or software interrupt

* Kinds

** Exception

Generated internally by the CPU and used to alert the running kernel of an event or situation

** IRQ

Interrupt Request (Hardware Interrupt), which is generated externally
by the chipset and is signalled by latching onto the =INTR= pin.

** Software Interrupt

To indicate that process need the kernel's attention (system call) with =INT N= instruction.

Most OS kernel choose just one port for software interrupt. Fox example, =0x80=

* 8259 PIC

Programmable Interrupt Controller, which the external devices connect
to this chip rather than connect directly to CPU. If there's an
interrupt in PIC's pin, CPU will stores state information on the stack
and jumps to a location pointed to by the IDT.

There're two PICs in cascade mode: master and slave (The IBM PC/AT 8259 PIC Architecture)
- The slave PIC's output signal is connected to the master PIC's #2 input port.
- master PIC's output signal is connected to CPU and tell CPU the interrupt occurred and send the interrupt number (=[0-256)=)
- By default IRQ 0-7 are set to interrupts 08h-0Fh, IRQs 8-15 are set to interrupts 70-77h
- Vector offset can be changed when re-initializing

** How Does it work?

1. External device notify the PIC that it needs servicing
2. PIC feed the CUP interrupt signal 
3. CPU accept the interrupt
4. PIC supply the interrupt number to the process
5. CPU looks up the interrupt address and act accordingly.

** Ports

| Chip - Purpose       | I/O port |
|----------------------+----------|
| Master PIC - Command | 0x0020   |
| Master PIC - Data    | 0x0021   |
| Slave PIC - Command  | 0x00a0   |
| Slave PIC - Data     | 0x00a1   |

** Instruction

| instruction            | code | description                                                                             |
|------------------------+------+-----------------------------------------------------------------------------------------|
| end of interrupt (EOI) | 0x20 | at the end of an IRQ-based interrupt routine                                            |
| initialise command     | 0x11 | make the PIC wait for 3 extra "initialisation words" on the data port: ICW2, ICW3, ICW4 |


** Data

| data | descrition                                         |
|------+----------------------------------------------------|
| ICW2 | Its vector offset                                  |
| ICW3 | Tell it how it is wired to master/slaves           |
| ICW4 | Gives additional information about the environment |

** Steps



** TODO External Device Connection Rules

- keyboard: IRQ1


* Code Analysis

** IDT

=kernel/core/idt.c= regists =[0-256)= handler
1. number
2. handler address
3. selector =0x08=
4. flag =0x8E=

*** Flag

Flag is set to =0x10001110= for the interrupt gate:
1. P bit = 1
2. DPL = 0


*** TODO Selector

=0x80= ?

*** Format

Refer to x86 IDT descriptor format [[file:x86.org::*Illustration][illustration]]

#+BEGIN_SRC c
/*
 * IDT Entry
 */
struct idt_entry {
        unsigned short base_low;
        unsigned short sel;
        unsigned char zero;
        unsigned char flags;
        unsigned short base_high;
} __attribute__((packed));
#+END_SRC


** ISR

=kernel/core/isrs.c= define the =[0,32)= ISR and the code is similar to =kernel/core/irq.c=.

Refer to the [[*IRQ][IRQ]] section.

*** error code

Some of the exceptions don't provide error code to the handler.

#+BEGIN_SRC nasm
; Interrupt Service Routines
%macro ISR_NOERR 1
        global _isr%1
        _isr%1:
                cli
                push byte 0
                push byte %1
                jmp isr_common_stub
%endmacro

%macro ISR_ERR 1
        global _isr%1
        _isr%1:
                cli
                push byte %1
                jmp isr_common_stub
%endmacro

; Standard X86 interrupt service routines
ISR_NOERR 0
ISR_NOERR 1
ISR_NOERR 2
ISR_NOERR 3
ISR_NOERR 4
ISR_NOERR 5
ISR_NOERR 6
ISR_NOERR 7
ISR_ERR   8
ISR_NOERR 9
ISR_ERR   10
ISR_ERR   11
ISR_ERR   12
ISR_ERR   13
ISR_ERR   14
ISR_NOERR 15
ISR_NOERR 16
ISR_NOERR 17
ISR_NOERR 18
ISR_NOERR 19
ISR_NOERR 20
ISR_NOERR 21
ISR_NOERR 22
ISR_NOERR 23
ISR_NOERR 24
ISR_NOERR 25
ISR_NOERR 26
ISR_NOERR 27
ISR_NOERR 28
ISR_NOERR 29
ISR_NOERR 30
ISR_NOERR 31
#+END_SRC

** IRQ

- install =[32,48)= ISR by default (in =irq_install=)
- extra 16 IRQ handler for the =[16,32)= ISR
- register with =irq_install_handler=, unregister with =irq_uninstall_handler=

