toarous/isr.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>isr.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/toarous/images">Prev: images</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/toarous">Up: toarous</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/toarous/keyboard.org.html">Next: keyboard.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="overview">Overview</h1>
<p>IDT (Interrupt Descriptor Table) maintains all handlers procedure information</p>
<ol class="incremental">
<li>ISR is short for Interrupt Service Routines which is the handler for the internal interrupt or exception.</li>
<li>IRQ for external interrupt or software interrupt</li>
</ol>
<h1 id="kinds">Kinds</h1>
<h2 id="exception">Exception</h2>
<p>Generated internally by the CPU and used to alert the running kernel of an event or situation</p>
<h2 id="irq">IRQ</h2>
<p>Interrupt Request (Hardware Interrupt), which is generated externally by the chipset and is signalled by latching onto the <code>INTR</code> pin.</p>
<h2 id="software-interrupt">Software Interrupt</h2>
<p>To indicate that process need the kernel's attention (system call) with <code>INT N</code> instruction.</p>
<p>Most OS kernel choose just one port for software interrupt. Fox example, <code>0x80</code></p>
<h1 id="pic">8259 PIC</h1>
<p>Programmable Interrupt Controller, which the external devices connect to this chip rather than connect directly to CPU. If there's an interrupt in PIC's pin, CPU will stores state information on the stack and jumps to a location pointed to by the IDT.</p>
<p>There're two PICs in cascade mode: master and slave (The IBM PC/AT 8259 PIC Architecture)</p>
<ul class="incremental">
<li>The slave PIC's output signal is connected to the master PIC's #2 input port.</li>
<li>master PIC's output signal is connected to CPU and tell CPU the interrupt occurred and send the interrupt number (<code>[0-256)</code>)</li>
<li>By default IRQ 0-7 are set to interrupts 08h-0Fh, IRQs 8-15 are set to interrupts 70-77h</li>
<li>Vector offset can be changed when re-initializing</li>
</ul>
<h2 id="how-does-it-work">How Does it work?</h2>
<ol class="incremental">
<li>External device notify the PIC that it needs servicing</li>
<li>PIC feed the CUP interrupt signal</li>
<li>CPU accept the interrupt</li>
<li>PIC supply the interrupt number to the process</li>
<li>CPU looks up the interrupt address and act accordingly.</li>
</ol>
<h2 id="ports">Ports</h2>
<table>
<thead>
<tr class="header">
<th>Chip - Purpose</th>
<th>I/O port</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>Master PIC - Command</td>
<td>0x0020</td>
</tr>
<tr class="even">
<td>Master PIC - Data</td>
<td>0x0021</td>
</tr>
<tr class="odd">
<td>Slave PIC - Command</td>
<td>0x00a0</td>
</tr>
<tr class="even">
<td>Slave PIC - Data</td>
<td>0x00a1</td>
</tr>
</tbody>
</table>
<h2 id="instruction">Instruction</h2>
<table>
<thead>
<tr class="header">
<th>instruction</th>
<th>code</th>
<th>description</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>end of interrupt (EOI)</td>
<td>0x20</td>
<td>at the end of an IRQ-based interrupt routine</td>
</tr>
<tr class="even">
<td>initialise command</td>
<td>0x11</td>
<td>make the PIC wait for 3 extra "initialisation words" on the data port: ICW2, ICW3, ICW4</td>
</tr>
</tbody>
</table>
<h2 id="data">Data</h2>
<table>
<thead>
<tr class="header">
<th>data</th>
<th>descrition</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>ICW2</td>
<td>Its vector offset</td>
</tr>
<tr class="even">
<td>ICW3</td>
<td>Tell it how it is wired to master/slaves</td>
</tr>
<tr class="odd">
<td>ICW4</td>
<td>Gives additional information about the environment</td>
</tr>
</tbody>
</table>
<h2 id="steps">Steps</h2>
<h2 id="external-device-connection-rules"><span class="todo TODO">TODO</span> External Device Connection Rules</h2>
<ul class="incremental">
<li>keyboard: IRQ1</li>
</ul>
<h1 id="code-analysis">Code Analysis</h1>
<h2 id="idt">IDT</h2>
<p><code>kernel/core/idt.c</code> regists <code>[0-256)</code> handler</p>
<ol class="incremental">
<li>number</li>
<li>handler address</li>
<li>selector <code>0x08</code></li>
<li>flag <code>0x8E</code></li>
</ol>
<h3 id="flag">Flag</h3>
<p>Flag is set to <code>0x10001110</code> for the interrupt gate:</p>
<ol class="incremental">
<li>P bit = 1</li>
<li>DPL = 0</li>
</ol>
<h3 id="selector"><span class="todo TODO">TODO</span> Selector</h3>
<p><code>0x80</code> ?</p>
<h3 id="format">Format</h3>
<p>Refer to x86 IDT descriptor format <a href="x86.org::*Illustration">illustration</a></p>
<div class="sourceCode" id="cb1"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb1-1"><a href="#cb1-1"></a><span class="co">/*</span></span>
<span id="cb1-2"><a href="#cb1-2"></a><span class="co"> * IDT Entry</span></span>
<span id="cb1-3"><a href="#cb1-3"></a><span class="co"> */</span></span>
<span id="cb1-4"><a href="#cb1-4"></a><span class="kw">struct</span> idt_entry {</span>
<span id="cb1-5"><a href="#cb1-5"></a>        <span class="dt">unsigned</span> <span class="dt">short</span> base_low;</span>
<span id="cb1-6"><a href="#cb1-6"></a>        <span class="dt">unsigned</span> <span class="dt">short</span> sel;</span>
<span id="cb1-7"><a href="#cb1-7"></a>        <span class="dt">unsigned</span> <span class="dt">char</span> zero;</span>
<span id="cb1-8"><a href="#cb1-8"></a>        <span class="dt">unsigned</span> <span class="dt">char</span> flags;</span>
<span id="cb1-9"><a href="#cb1-9"></a>        <span class="dt">unsigned</span> <span class="dt">short</span> base_high;</span>
<span id="cb1-10"><a href="#cb1-10"></a>} __attribute__((packed));</span></code></pre></div>
<h2 id="isr">ISR</h2>
<p><code>kernel/core/isrs.c</code> define the <code>[0,32)</code> ISR and the code is similar to <code>kernel/core/irq.c</code>.</p>
<p>Refer to the <em>IRQ</em> section.</p>
<h3 id="error-code">error code</h3>
<p>Some of the exceptions don't provide error code to the handler.</p>
<div class="sourceCode" id="cb2"><pre class="sourceCode nasm"><code class="sourceCode nasm"><span id="cb2-1"><a href="#cb2-1"></a><span class="co">; Interrupt Service Routines</span></span>
<span id="cb2-2"><a href="#cb2-2"></a><span class="ot">%macro ISR_NOERR 1</span></span>
<span id="cb2-3"><a href="#cb2-3"></a>        <span class="kw">global</span> _isr<span class="ot">%1</span></span>
<span id="cb2-4"><a href="#cb2-4"></a>        _isr<span class="ot">%1:</span></span>
<span id="cb2-5"><a href="#cb2-5"></a>                <span class="kw">cli</span></span>
<span id="cb2-6"><a href="#cb2-6"></a>                <span class="kw">push</span> <span class="dt">byte</span> <span class="dv">0</span></span>
<span id="cb2-7"><a href="#cb2-7"></a>                <span class="kw">push</span> <span class="dt">byte</span> <span class="ot">%1</span></span>
<span id="cb2-8"><a href="#cb2-8"></a>                <span class="kw">jmp</span> isr_common_stub</span>
<span id="cb2-9"><a href="#cb2-9"></a><span class="ot">%endmacro</span></span>
<span id="cb2-10"><a href="#cb2-10"></a></span>
<span id="cb2-11"><a href="#cb2-11"></a><span class="ot">%macro ISR_ERR 1</span></span>
<span id="cb2-12"><a href="#cb2-12"></a>        <span class="kw">global</span> _isr<span class="ot">%1</span></span>
<span id="cb2-13"><a href="#cb2-13"></a>        _isr<span class="ot">%1:</span></span>
<span id="cb2-14"><a href="#cb2-14"></a>                <span class="kw">cli</span></span>
<span id="cb2-15"><a href="#cb2-15"></a>                <span class="kw">push</span> <span class="dt">byte</span> <span class="ot">%1</span></span>
<span id="cb2-16"><a href="#cb2-16"></a>                <span class="kw">jmp</span> isr_common_stub</span>
<span id="cb2-17"><a href="#cb2-17"></a><span class="ot">%endmacro</span></span>
<span id="cb2-18"><a href="#cb2-18"></a></span>
<span id="cb2-19"><a href="#cb2-19"></a><span class="co">; Standard X86 interrupt service routines</span></span>
<span id="cb2-20"><a href="#cb2-20"></a>ISR_NOERR <span class="dv">0</span></span>
<span id="cb2-21"><a href="#cb2-21"></a>ISR_NOERR <span class="dv">1</span></span>
<span id="cb2-22"><a href="#cb2-22"></a>ISR_NOERR <span class="dv">2</span></span>
<span id="cb2-23"><a href="#cb2-23"></a>ISR_NOERR <span class="dv">3</span></span>
<span id="cb2-24"><a href="#cb2-24"></a>ISR_NOERR <span class="dv">4</span></span>
<span id="cb2-25"><a href="#cb2-25"></a>ISR_NOERR <span class="dv">5</span></span>
<span id="cb2-26"><a href="#cb2-26"></a>ISR_NOERR <span class="dv">6</span></span>
<span id="cb2-27"><a href="#cb2-27"></a>ISR_NOERR <span class="dv">7</span></span>
<span id="cb2-28"><a href="#cb2-28"></a>ISR_ERR   <span class="dv">8</span></span>
<span id="cb2-29"><a href="#cb2-29"></a>ISR_NOERR <span class="dv">9</span></span>
<span id="cb2-30"><a href="#cb2-30"></a>ISR_ERR   <span class="dv">10</span></span>
<span id="cb2-31"><a href="#cb2-31"></a>ISR_ERR   <span class="dv">11</span></span>
<span id="cb2-32"><a href="#cb2-32"></a>ISR_ERR   <span class="dv">12</span></span>
<span id="cb2-33"><a href="#cb2-33"></a>ISR_ERR   <span class="dv">13</span></span>
<span id="cb2-34"><a href="#cb2-34"></a>ISR_ERR   <span class="dv">14</span></span>
<span id="cb2-35"><a href="#cb2-35"></a>ISR_NOERR <span class="dv">15</span></span>
<span id="cb2-36"><a href="#cb2-36"></a>ISR_NOERR <span class="dv">16</span></span>
<span id="cb2-37"><a href="#cb2-37"></a>ISR_NOERR <span class="dv">17</span></span>
<span id="cb2-38"><a href="#cb2-38"></a>ISR_NOERR <span class="dv">18</span></span>
<span id="cb2-39"><a href="#cb2-39"></a>ISR_NOERR <span class="dv">19</span></span>
<span id="cb2-40"><a href="#cb2-40"></a>ISR_NOERR <span class="dv">20</span></span>
<span id="cb2-41"><a href="#cb2-41"></a>ISR_NOERR <span class="dv">21</span></span>
<span id="cb2-42"><a href="#cb2-42"></a>ISR_NOERR <span class="dv">22</span></span>
<span id="cb2-43"><a href="#cb2-43"></a>ISR_NOERR <span class="dv">23</span></span>
<span id="cb2-44"><a href="#cb2-44"></a>ISR_NOERR <span class="dv">24</span></span>
<span id="cb2-45"><a href="#cb2-45"></a>ISR_NOERR <span class="dv">25</span></span>
<span id="cb2-46"><a href="#cb2-46"></a>ISR_NOERR <span class="dv">26</span></span>
<span id="cb2-47"><a href="#cb2-47"></a>ISR_NOERR <span class="dv">27</span></span>
<span id="cb2-48"><a href="#cb2-48"></a>ISR_NOERR <span class="dv">28</span></span>
<span id="cb2-49"><a href="#cb2-49"></a>ISR_NOERR <span class="dv">29</span></span>
<span id="cb2-50"><a href="#cb2-50"></a>ISR_NOERR <span class="dv">30</span></span>
<span id="cb2-51"><a href="#cb2-51"></a>ISR_NOERR <span class="dv">31</span></span></code></pre></div>
<h2 id="irq-1">IRQ</h2>
<ul class="incremental">
<li>install <code>[32,48)</code> ISR by default (in <code>irq_install</code>)</li>
<li>extra 16 IRQ handler for the <code>[16,32)</code> ISR</li>
<li>register with <code>irq_install_handler</code>, unregister with <code>irq_uninstall_handler</code></li>
</ul>
