toarous/isr.org
*** handler

#+BEGIN_SRC c
typedef void (*irq_handler_t) (struct regs *);

// irq_hander_t is the function pointer
static irq_handler_t irq_routines[16] = { NULL };

void
irq_handler(struct regs *r) {
        // define a new funcion pointer handler
        void (*handler)(struct regs *r);

        // the function pointer is the IRQ handler
        handler = irq_routines[r->int_no - 32];

        // skip if no handler was bound
        if (handler) {
                handler(r);
        }

        // interrupt is trigger by PIC2, send EOI to PIC2 data
        if (r->int_no >= 40) {
                outportb(0xA0, 0x20);
        }

        // send EOI to PIC1 data
        outportb(0x20, 0x20);
}
#+END_SRC


*** initialise

**** remap vector offset

#+BEGIN_SRC c
void
irq_remap() {
        // PIC1 initialization
        outportb(0x20, 0x11);
        // PIC2 initialization
        outportb(0xA0, 0x11);
        // PIC1 ICW2 vector offset 0x20
        outportb(0x21, 0x20);
        // PIC2 ICW2 vector offset 0x28
        outportb(0xA1, 0x28);
        // PIC1 ICW3 wired: 0b00000100, PIC2 output connects to PIC1 input #2
        outportb(0x21, 0x04);
        // PIC2 ICW3 identity: 0x02
        outportb(0xA1, 0x02);
        // PIC1 ICW4: 8086/88 (MCS-80/85) mode
        outportb(0x21, 0x01);
        // PIC2 ICW4: 8086/88 (MCS-80/85) mode
        outportb(0xA1, 0x01);
        // clear mask
        outportb(0x21, 0x0);
        outportb(0xA1, 0x0);
}
#+END_SRC


**** set irq handler

#+BEGIN_SRC c
void
irq_install() {
        irq_remap();
        idt_set_gate(32, (unsigned)_irq0, 0x08, 0x8E);
        idt_set_gate(33, (unsigned)_irq1, 0x08, 0x8E);
        idt_set_gate(34, (unsigned)_irq2, 0x08, 0x8E);
        idt_set_gate(35, (unsigned)_irq3, 0x08, 0x8E);
        idt_set_gate(36, (unsigned)_irq4, 0x08, 0x8E);
        idt_set_gate(37, (unsigned)_irq5, 0x08, 0x8E);
        idt_set_gate(38, (unsigned)_irq6, 0x08, 0x8E);
        idt_set_gate(39, (unsigned)_irq7, 0x08, 0x8E);
        idt_set_gate(40, (unsigned)_irq8, 0x08, 0x8E);
        idt_set_gate(41, (unsigned)_irq9, 0x08, 0x8E);
        idt_set_gate(42, (unsigned)_irq10, 0x08, 0x8E);
        idt_set_gate(43, (unsigned)_irq11, 0x08, 0x8E);
        idt_set_gate(44, (unsigned)_irq12, 0x08, 0x8E);
        idt_set_gate(45, (unsigned)_irq13, 0x08, 0x8E);
        idt_set_gate(46, (unsigned)_irq14, 0x08, 0x8E);
        idt_set_gate(47, (unsigned)_irq15, 0x08, 0x8E);
        __asm__ __volatile__("sti");
}
#+END_SRC

*** C function wrapper

The =irq_handler= C function is wrappered by assemble codes

