toarous/isr.org.html
<h3 id="handler">handler</h3>
<div class="sourceCode" id="cb3"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb3-1"><a href="#cb3-1"></a><span class="kw">typedef</span> <span class="dt">void</span> (*irq_handler_t) (<span class="kw">struct</span> regs *);</span>
<span id="cb3-2"><a href="#cb3-2"></a></span>
<span id="cb3-3"><a href="#cb3-3"></a><span class="co">// irq_hander_t is the function pointer</span></span>
<span id="cb3-4"><a href="#cb3-4"></a><span class="dt">static</span> irq_handler_t irq_routines[<span class="dv">16</span>] = { NULL };</span>
<span id="cb3-5"><a href="#cb3-5"></a></span>
<span id="cb3-6"><a href="#cb3-6"></a><span class="dt">void</span></span>
<span id="cb3-7"><a href="#cb3-7"></a>irq_handler(<span class="kw">struct</span> regs *r) {</span>
<span id="cb3-8"><a href="#cb3-8"></a>        <span class="co">// define a new funcion pointer handler</span></span>
<span id="cb3-9"><a href="#cb3-9"></a>        <span class="dt">void</span> (*handler)(<span class="kw">struct</span> regs *r);</span>
<span id="cb3-10"><a href="#cb3-10"></a></span>
<span id="cb3-11"><a href="#cb3-11"></a>        <span class="co">// the function pointer is the IRQ handler</span></span>
<span id="cb3-12"><a href="#cb3-12"></a>        handler = irq_routines[r-&gt;int_no - <span class="dv">32</span>];</span>
<span id="cb3-13"><a href="#cb3-13"></a></span>
<span id="cb3-14"><a href="#cb3-14"></a>        <span class="co">// skip if no handler was bound</span></span>
<span id="cb3-15"><a href="#cb3-15"></a>        <span class="cf">if</span> (handler) {</span>
<span id="cb3-16"><a href="#cb3-16"></a>                handler(r);</span>
<span id="cb3-17"><a href="#cb3-17"></a>        }</span>
<span id="cb3-18"><a href="#cb3-18"></a></span>
<span id="cb3-19"><a href="#cb3-19"></a>        <span class="co">// interrupt is trigger by PIC2, send EOI to PIC2 data</span></span>
<span id="cb3-20"><a href="#cb3-20"></a>        <span class="cf">if</span> (r-&gt;int_no &gt;= <span class="dv">40</span>) {</span>
<span id="cb3-21"><a href="#cb3-21"></a>                outportb(<span class="bn">0xA0</span>, <span class="bn">0x20</span>);</span>
<span id="cb3-22"><a href="#cb3-22"></a>        }</span>
<span id="cb3-23"><a href="#cb3-23"></a></span>
<span id="cb3-24"><a href="#cb3-24"></a>        <span class="co">// send EOI to PIC1 data</span></span>
<span id="cb3-25"><a href="#cb3-25"></a>        outportb(<span class="bn">0x20</span>, <span class="bn">0x20</span>);</span>
<span id="cb3-26"><a href="#cb3-26"></a>}</span></code></pre></div>
<h3 id="initialise">initialise</h3>
<ol class="incremental">
<li><p>remap vector offset</p>
<div class="sourceCode" id="cb4"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb4-1"><a href="#cb4-1"></a><span class="dt">void</span></span>
<span id="cb4-2"><a href="#cb4-2"></a>irq_remap() {</span>
<span id="cb4-3"><a href="#cb4-3"></a>        <span class="co">// PIC1 initialization</span></span>
<span id="cb4-4"><a href="#cb4-4"></a>        outportb(<span class="bn">0x20</span>, <span class="bn">0x11</span>);</span>
<span id="cb4-5"><a href="#cb4-5"></a>        <span class="co">// PIC2 initialization</span></span>
<span id="cb4-6"><a href="#cb4-6"></a>        outportb(<span class="bn">0xA0</span>, <span class="bn">0x11</span>);</span>
<span id="cb4-7"><a href="#cb4-7"></a>        <span class="co">// PIC1 ICW2 vector offset 0x20</span></span>
<span id="cb4-8"><a href="#cb4-8"></a>        outportb(<span class="bn">0x21</span>, <span class="bn">0x20</span>);</span>
<span id="cb4-9"><a href="#cb4-9"></a>        <span class="co">// PIC2 ICW2 vector offset 0x28</span></span>
<span id="cb4-10"><a href="#cb4-10"></a>        outportb(<span class="bn">0xA1</span>, <span class="bn">0x28</span>);</span>
<span id="cb4-11"><a href="#cb4-11"></a>        <span class="co">// PIC1 ICW3 wired: 0b00000100, PIC2 output connects to PIC1 input #2</span></span>
<span id="cb4-12"><a href="#cb4-12"></a>        outportb(<span class="bn">0x21</span>, <span class="bn">0x04</span>);</span>
<span id="cb4-13"><a href="#cb4-13"></a>        <span class="co">// PIC2 ICW3 identity: 0x02</span></span>
<span id="cb4-14"><a href="#cb4-14"></a>        outportb(<span class="bn">0xA1</span>, <span class="bn">0x02</span>);</span>
<span id="cb4-15"><a href="#cb4-15"></a>        <span class="co">// PIC1 ICW4: 8086/88 (MCS-80/85) mode</span></span>
<span id="cb4-16"><a href="#cb4-16"></a>        outportb(<span class="bn">0x21</span>, <span class="bn">0x01</span>);</span>
<span id="cb4-17"><a href="#cb4-17"></a>        <span class="co">// PIC2 ICW4: 8086/88 (MCS-80/85) mode</span></span>
<span id="cb4-18"><a href="#cb4-18"></a>        outportb(<span class="bn">0xA1</span>, <span class="bn">0x01</span>);</span>
<span id="cb4-19"><a href="#cb4-19"></a>        <span class="co">// clear mask</span></span>
<span id="cb4-20"><a href="#cb4-20"></a>        outportb(<span class="bn">0x21</span>, <span class="bn">0x0</span>);</span>
<span id="cb4-21"><a href="#cb4-21"></a>        outportb(<span class="bn">0xA1</span>, <span class="bn">0x0</span>);</span>
<span id="cb4-22"><a href="#cb4-22"></a>}</span></code></pre></div></li>
<li><p>set irq handler</p>
<div class="sourceCode" id="cb5"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb5-1"><a href="#cb5-1"></a><span class="dt">void</span></span>
<span id="cb5-2"><a href="#cb5-2"></a>irq_install() {</span>
<span id="cb5-3"><a href="#cb5-3"></a>        irq_remap();</span>
<span id="cb5-4"><a href="#cb5-4"></a>        idt_set_gate(<span class="dv">32</span>, (<span class="dt">unsigned</span>)_irq0, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-5"><a href="#cb5-5"></a>        idt_set_gate(<span class="dv">33</span>, (<span class="dt">unsigned</span>)_irq1, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-6"><a href="#cb5-6"></a>        idt_set_gate(<span class="dv">34</span>, (<span class="dt">unsigned</span>)_irq2, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-7"><a href="#cb5-7"></a>        idt_set_gate(<span class="dv">35</span>, (<span class="dt">unsigned</span>)_irq3, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-8"><a href="#cb5-8"></a>        idt_set_gate(<span class="dv">36</span>, (<span class="dt">unsigned</span>)_irq4, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-9"><a href="#cb5-9"></a>        idt_set_gate(<span class="dv">37</span>, (<span class="dt">unsigned</span>)_irq5, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-10"><a href="#cb5-10"></a>        idt_set_gate(<span class="dv">38</span>, (<span class="dt">unsigned</span>)_irq6, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-11"><a href="#cb5-11"></a>        idt_set_gate(<span class="dv">39</span>, (<span class="dt">unsigned</span>)_irq7, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-12"><a href="#cb5-12"></a>        idt_set_gate(<span class="dv">40</span>, (<span class="dt">unsigned</span>)_irq8, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-13"><a href="#cb5-13"></a>        idt_set_gate(<span class="dv">41</span>, (<span class="dt">unsigned</span>)_irq9, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-14"><a href="#cb5-14"></a>        idt_set_gate(<span class="dv">42</span>, (<span class="dt">unsigned</span>)_irq10, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-15"><a href="#cb5-15"></a>        idt_set_gate(<span class="dv">43</span>, (<span class="dt">unsigned</span>)_irq11, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-16"><a href="#cb5-16"></a>        idt_set_gate(<span class="dv">44</span>, (<span class="dt">unsigned</span>)_irq12, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-17"><a href="#cb5-17"></a>        idt_set_gate(<span class="dv">45</span>, (<span class="dt">unsigned</span>)_irq13, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-18"><a href="#cb5-18"></a>        idt_set_gate(<span class="dv">46</span>, (<span class="dt">unsigned</span>)_irq14, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-19"><a href="#cb5-19"></a>        idt_set_gate(<span class="dv">47</span>, (<span class="dt">unsigned</span>)_irq15, <span class="bn">0x08</span>, <span class="bn">0x8E</span>);</span>
<span id="cb5-20"><a href="#cb5-20"></a>        __asm__ __volatile__(<span class="st">&quot;sti&quot;</span>);</span>
<span id="cb5-21"><a href="#cb5-21"></a>}</span></code></pre></div></li>
</ol>
<h3 id="c-function-wrapper">C function wrapper</h3>
<p>The <code>irq_handler</code> C function is wrappered by assemble codes</p>
<ol class="incremental">
