toarous/isr.org
**** =_irqN= definition

#+BEGIN_SRC nasm
%macro IRQ_ENTRY 2
        global _irq%1
        _irq%1:
                cli
                push byte 0
                push byte %2
                jmp irq_common_stub
%endmacro

; Interrupt Requests
IRQ_ENTRY 0, 32
IRQ_ENTRY 1, 33
IRQ_ENTRY 2, 34
IRQ_ENTRY 3, 35
IRQ_ENTRY 4, 36
IRQ_ENTRY 5, 37
IRQ_ENTRY 6, 38
IRQ_ENTRY 7, 39
IRQ_ENTRY 8, 40
IRQ_ENTRY 9, 41
IRQ_ENTRY 10, 42
IRQ_ENTRY 11, 43
IRQ_ENTRY 12, 44
IRQ_ENTRY 13, 45
IRQ_ENTRY 14, 46
IRQ_ENTRY 15, 47
#+END_SRC

Define a macro =IRQ_ENTRY= which accepts two parameter and expand to 

#+BEGIN_SRC nasm
global _irq0
irq0:
   cli
   push byte 0    ; PIC port
   push byte 32   ; IRQ ID
   jmp irq_common_stub
...
#+END_SRC

**** wrapper

Pass =struct *reg= parameter to C function =irq_handler=

#+BEGIN_SRC c
// kernel/include/system.h
/* Registers */
struct regs {
        unsigned int gs, fs, es, ds;
        unsigned int edi, esi, ebp, esp, ebx, edx, ecx, eax;
        unsigned int int_no, err_code;
        unsigned int eip, cs, eflags, useresp, ss;
};      
#+END_SRC

#+BEGIN_SRC nasm
irq_common_stub:
        pusha     ;; any other registers
        push ds   ;; be care for the order
        push es
        push fs
        push gs
        mov ax, 0x10   ;; selector ??
        mov ds, ax
        mov es, ax
        mov fs, ax
        mov gs, ax
        mov eax, esp
        push eax
        ; Call the C kernel hardware interrupt handler
        mov eax, irq_handler
        call eax
        pop eax
        pop gs
        pop fs
        pop es
        pop ds
        popa
        add esp, 8
        iret
#+END_SRC

* Reference

- [[https://wiki.osdev.org/PIC#Programming_the_PIC_chips][8259 PIC wiki.osdev.org]]
- [[https://nasm.us/doc/nasmdoc4.html][The NASM Preprocessor]]
