toarous/isr.org.html
<li><p><code>_irqN</code> definition</p>
<div class="sourceCode" id="cb6"><pre class="sourceCode nasm"><code class="sourceCode nasm"><span id="cb6-1"><a href="#cb6-1"></a><span class="ot">%macro IRQ_ENTRY 2</span></span>
<span id="cb6-2"><a href="#cb6-2"></a>        <span class="kw">global</span> _irq<span class="ot">%1</span></span>
<span id="cb6-3"><a href="#cb6-3"></a>        _irq<span class="ot">%1:</span></span>
<span id="cb6-4"><a href="#cb6-4"></a>                <span class="kw">cli</span></span>
<span id="cb6-5"><a href="#cb6-5"></a>                <span class="kw">push</span> <span class="dt">byte</span> <span class="dv">0</span></span>
<span id="cb6-6"><a href="#cb6-6"></a>                <span class="kw">push</span> <span class="dt">byte</span> <span class="ot">%2</span></span>
<span id="cb6-7"><a href="#cb6-7"></a>                <span class="kw">jmp</span> irq_common_stub</span>
<span id="cb6-8"><a href="#cb6-8"></a><span class="ot">%endmacro</span></span>
<span id="cb6-9"><a href="#cb6-9"></a></span>
<span id="cb6-10"><a href="#cb6-10"></a><span class="co">; Interrupt Requests</span></span>
<span id="cb6-11"><a href="#cb6-11"></a>IRQ_ENTRY <span class="dv">0</span>, <span class="dv">32</span></span>
<span id="cb6-12"><a href="#cb6-12"></a>IRQ_ENTRY <span class="dv">1</span>, <span class="dv">33</span></span>
<span id="cb6-13"><a href="#cb6-13"></a>IRQ_ENTRY <span class="dv">2</span>, <span class="dv">34</span></span>
<span id="cb6-14"><a href="#cb6-14"></a>IRQ_ENTRY <span class="dv">3</span>, <span class="dv">35</span></span>
<span id="cb6-15"><a href="#cb6-15"></a>IRQ_ENTRY <span class="dv">4</span>, <span class="dv">36</span></span>
<span id="cb6-16"><a href="#cb6-16"></a>IRQ_ENTRY <span class="dv">5</span>, <span class="dv">37</span></span>
<span id="cb6-17"><a href="#cb6-17"></a>IRQ_ENTRY <span class="dv">6</span>, <span class="dv">38</span></span>
<span id="cb6-18"><a href="#cb6-18"></a>IRQ_ENTRY <span class="dv">7</span>, <span class="dv">39</span></span>
<span id="cb6-19"><a href="#cb6-19"></a>IRQ_ENTRY <span class="dv">8</span>, <span class="dv">40</span></span>
<span id="cb6-20"><a href="#cb6-20"></a>IRQ_ENTRY <span class="dv">9</span>, <span class="dv">41</span></span>
<span id="cb6-21"><a href="#cb6-21"></a>IRQ_ENTRY <span class="dv">10</span>, <span class="dv">42</span></span>
<span id="cb6-22"><a href="#cb6-22"></a>IRQ_ENTRY <span class="dv">11</span>, <span class="dv">43</span></span>
<span id="cb6-23"><a href="#cb6-23"></a>IRQ_ENTRY <span class="dv">12</span>, <span class="dv">44</span></span>
<span id="cb6-24"><a href="#cb6-24"></a>IRQ_ENTRY <span class="dv">13</span>, <span class="dv">45</span></span>
<span id="cb6-25"><a href="#cb6-25"></a>IRQ_ENTRY <span class="dv">14</span>, <span class="dv">46</span></span>
<span id="cb6-26"><a href="#cb6-26"></a>IRQ_ENTRY <span class="dv">15</span>, <span class="dv">47</span></span></code></pre></div>
<p>Define a macro <code>IRQ_ENTRY</code> which accepts two parameter and expand to</p>
<div class="sourceCode" id="cb7"><pre class="sourceCode nasm"><code class="sourceCode nasm"><span id="cb7-1"><a href="#cb7-1"></a><span class="kw">global</span> _irq0</span>
<span id="cb7-2"><a href="#cb7-2"></a><span class="fu">irq0:</span></span>
<span id="cb7-3"><a href="#cb7-3"></a>   <span class="kw">cli</span></span>
<span id="cb7-4"><a href="#cb7-4"></a>   <span class="kw">push</span> <span class="dt">byte</span> <span class="dv">0</span>    <span class="co">; PIC port</span></span>
<span id="cb7-5"><a href="#cb7-5"></a>   <span class="kw">push</span> <span class="dt">byte</span> <span class="dv">32</span>   <span class="co">; IRQ ID</span></span>
<span id="cb7-6"><a href="#cb7-6"></a>   <span class="kw">jmp</span> irq_common_stub</span>
<span id="cb7-7"><a href="#cb7-7"></a>...</span></code></pre></div></li>
<li><p>wrapper</p>
<p>Pass <code>struct *reg</code> parameter to C function <code>irq_handler</code></p>
<div class="sourceCode" id="cb8"><pre class="sourceCode c"><code class="sourceCode c"><span id="cb8-1"><a href="#cb8-1"></a><span class="co">// kernel/include/system.h</span></span>
<span id="cb8-2"><a href="#cb8-2"></a><span class="co">/* Registers */</span></span>
<span id="cb8-3"><a href="#cb8-3"></a><span class="kw">struct</span> regs {</span>
<span id="cb8-4"><a href="#cb8-4"></a>        <span class="dt">unsigned</span> <span class="dt">int</span> gs, fs, es, ds;</span>
<span id="cb8-5"><a href="#cb8-5"></a>        <span class="dt">unsigned</span> <span class="dt">int</span> edi, esi, ebp, esp, ebx, edx, ecx, eax;</span>
<span id="cb8-6"><a href="#cb8-6"></a>        <span class="dt">unsigned</span> <span class="dt">int</span> int_no, err_code;</span>
<span id="cb8-7"><a href="#cb8-7"></a>        <span class="dt">unsigned</span> <span class="dt">int</span> eip, cs, eflags, useresp, ss;</span>
<span id="cb8-8"><a href="#cb8-8"></a>};      </span></code></pre></div>
<div class="sourceCode" id="cb9"><pre class="sourceCode nasm"><code class="sourceCode nasm"><span id="cb9-1"><a href="#cb9-1"></a><span class="fu">irq_common_stub:</span></span>
<span id="cb9-2"><a href="#cb9-2"></a>        <span class="kw">pusha</span>     <span class="co">;; any other registers</span></span>
<span id="cb9-3"><a href="#cb9-3"></a>        <span class="kw">push</span> <span class="kw">ds</span>   <span class="co">;; be care for the order</span></span>
<span id="cb9-4"><a href="#cb9-4"></a>        <span class="kw">push</span> <span class="kw">es</span></span>
<span id="cb9-5"><a href="#cb9-5"></a>        <span class="kw">push</span> <span class="kw">fs</span></span>
<span id="cb9-6"><a href="#cb9-6"></a>        <span class="kw">push</span> <span class="kw">gs</span></span>
<span id="cb9-7"><a href="#cb9-7"></a>        <span class="kw">mov</span> <span class="kw">ax</span><span class="bn">, 0x10   </span><span class="co">;; selector ??</span></span>
<span id="cb9-8"><a href="#cb9-8"></a>        <span class="kw">mov</span> <span class="kw">ds</span>, <span class="kw">ax</span></span>
<span id="cb9-9"><a href="#cb9-9"></a>        <span class="kw">mov</span> <span class="kw">es</span>, <span class="kw">ax</span></span>
<span id="cb9-10"><a href="#cb9-10"></a>        <span class="kw">mov</span> <span class="kw">fs</span>, <span class="kw">ax</span></span>
<span id="cb9-11"><a href="#cb9-11"></a>        <span class="kw">mov</span> <span class="kw">gs</span>, <span class="kw">ax</span></span>
<span id="cb9-12"><a href="#cb9-12"></a>        <span class="kw">mov</span> <span class="kw">eax</span>, <span class="kw">esp</span></span>
<span id="cb9-13"><a href="#cb9-13"></a>        <span class="kw">push</span> <span class="kw">eax</span></span>
<span id="cb9-14"><a href="#cb9-14"></a>        <span class="co">; Call the C kernel hardware interrupt handler</span></span>
<span id="cb9-15"><a href="#cb9-15"></a>        <span class="kw">mov</span> <span class="kw">eax</span>, irq_handler</span>
<span id="cb9-16"><a href="#cb9-16"></a>        <span class="kw">call</span> <span class="kw">eax</span></span>
<span id="cb9-17"><a href="#cb9-17"></a>        <span class="kw">pop</span> <span class="kw">eax</span></span>
<span id="cb9-18"><a href="#cb9-18"></a>        <span class="kw">pop</span> <span class="kw">gs</span></span>
<span id="cb9-19"><a href="#cb9-19"></a>        <span class="kw">pop</span> <span class="kw">fs</span></span>
<span id="cb9-20"><a href="#cb9-20"></a>        <span class="kw">pop</span> <span class="kw">es</span></span>
<span id="cb9-21"><a href="#cb9-21"></a>        <span class="kw">pop</span> <span class="kw">ds</span></span>
<span id="cb9-22"><a href="#cb9-22"></a>        <span class="kw">popa</span></span>
<span id="cb9-23"><a href="#cb9-23"></a>        <span class="kw">add</span> <span class="kw">esp</span>, <span class="dv">8</span></span>
<span id="cb9-24"><a href="#cb9-24"></a>        <span class="kw">iret</span></span></code></pre></div></li>
</ol>
<h1 id="reference">Reference</h1>
<ul class="incremental">
<li><a href="https://wiki.osdev.org/PIC#Programming_the_PIC_chips">8259 PIC wiki.osdev.org</a></li>
<li><a href="https://nasm.us/doc/nasmdoc4.html">The NASM Preprocessor</a></li>
</ul>

      </div>
    </section>
  </body>
</html>
